# Модуль my_module.py

def module_description():
    """
    Описание модуля:

    Этот модуль содержит набор функций для демонстрации основных концепций программирования на Python.
    """

def greet_user(name):
    """
    Функция приветствия пользователя.

    Параметры:
    - name (str): Имя пользователя.

    Возвращает:
    - str: Приветствие с именем пользователя.
    """
    return f"Привет, {name}!"

def add(a, b):
    """
    Функция сложения двух чисел.

    Параметры:
    - a (int/float): Первое число.
    - b (int/float): Второе число.

    Возвращает:
    - int/float: Сумму a и b.
    """
    return a + b
